package by.htp.les07.matrix;
// 36. Операция сглаживания матрицы дает новую матрицу того же размера, каждый элемент которой получается
// как среднее арифметическое соседей соответствующего элемента исходной матрицы. Построить результат
// сглаживания заданной матрицы
public class Task_36 {
	public static void task () {
		System.out.println ("36. Операция сглаживания матрицы дает новую матрицу того же размера, каждый элемент которой получается\r\n" + 
				"как среднее арифметическое соседей соответствующего элемента исходной матрицы. Построить результат\r\n" + 
				"сглаживания заданной матрицы");
		
	}
}
